
## :white_check_mark: Apply Succeeded (dev)

[CI link](https://github.com/fumi-mura/terraform-sample/actions/runs/14737830667)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.oidc_iam_policy.data.aws_iam_policy_document.this: Reading...
module.test_1_cwlogs.aws_cloudwatch_log_group.this: Refreshing state... [id=test-1]
module.oidc_provider.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::598981015011:oidc-provider/token.actions.githubusercontent.com]
module.oidc_iam_policy.data.aws_iam_policy_document.this: Read complete after 0s [id=1789900679]
module.oidc_iam_policy.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::598981015011:policy/dev-fumis-pf-oidc-iam-policy]
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Reading...
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=777815669]
module.oidc_iam_role.aws_iam_role.this: Refreshing state... [id=dev-fumis-pf-oidc-iam-role]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test_2_cwlogs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "test-2"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "test-2"
        }
      + tags_all          = {
          + "Environment"        = "dev"
          + "ManagedByTerraform" = "true"
          + "Name"               = "test-2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.test_2_cwlogs.aws_cloudwatch_log_group.this: Creating...
module.test_2_cwlogs.aws_cloudwatch_log_group.this: Creation complete after 0s [id=test-2]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":41,"Program":"tfcmt","SHA1":"11e0000183570c8435a6707d2fdffcfc9f5f90f9","Target":"dev","Vars":{},"WorkflowName":"Apply"} -->